oar/index.html
---
layout: page
title: Index
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Organisation und Architektur von Rechnern</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="../digisys/stellwertsystem.html">B-adische Zahlendarstellung</a>
</li>
<li><a href="../digisys/b_komplement_darstellung.html">Zweierkomplementdarstellung</a>
</li>
<li><a href="../lang/c.html">C</a>

<ul class="org-ul">
<li>abstrakte Datentypen (struct)
</li>
<li>Bitoperationen
</li>
</ul>
</li>

<li><a href="../digisys/groesseneinheiten.html">little Endian / big Endian</a>
</li>
<li><a href="./ia32_assembler.html">IA31 Assembler</a>

<ul class="org-ul">
<li><a href="./ia32_assembler.html">Register</a>
</li>
<li><a href="./ia32_assembler.html">Stack</a>
</li>
</ul>
</li>

<li><a href="./speicherhierarchie.html">Speicherhierarchie</a>
</li>
<li><a href="./caches.html">Caches</a>

<ul class="org-ul">
<li>Adressierung in Caches (Lookups)
</li>
<li>Cache Sets, Tag Bits, Set Index Bits, Block Offset Bits
</li>
<li>assoziative Caches
</li>
<li>direct mapped Caches
</li>
<li>Anzahl Lese- und Schreibzugriffe
</li>
<li>Cache Misses und Miss-Rate
</li>
</ul>
</li>

<li><a href="../os/locality_of_reference.html">Lokalität</a>
</li>
<li><a href="../os/interrupts.html">Interrupts</a>
</li>
<li><a href="../os/virtual_memory.html">Virtual Memory</a>
</li>
<li><a href="../os/process.html">Prozesse</a>
</li>
</ul>
</div>
</div>
